#### GradientInterpolationType Enumeration

---

|  |
| --- |
| See Also |

The enumerated type representing the permitted values for the asset property "GradientInterpolation" from the "Gradient" schema.

**Namespace:**   Autodesk.Revit.DB.Visual
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.2.0.0)

# Syntax

| C# |
| --- |
| ``` public enum GradientInterpolationType ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration GradientInterpolationType ``` |

| Visual C++ |
| --- |
| ``` public enum class GradientInterpolationType ``` |

# Members

| Member name | Description |
| --- | --- |
| Custom |  |
| Easein |  |
| Easeinout |  |
| Easeout |  |
| Linear |  |
| Solid |  |

# See Also

Autodesk.Revit.DB.Visual Namespace